In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'C:\\Users\\danie\\Shift Academy Data Science Bootcamp Batch 10'

In [3]:
titanic = pd.read_csv('data_titanic.csv')

In [4]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## HOMEWORK

1. Munculkan 10 nama, sex, age dari passenger dengan harga tiket (Fare) termahal hingga termurah

2. Ada berapa jenis / unique value dari kolom Pclass? Urutkan dari nilai penjumlahan dari kecil hingga terbesar

3. Berapa rata-rata Fare male dan female?

4. Berapa banyak passenger male dan female yang survived dan Embarked di 'S'?

## Jawaban
1. Munculkan 10 nama, sex, age dari passenger dengan harga tiket (Fare) termahal hingga termurah

In [5]:
titanic[['Name', 'Sex', 'Age', 'Fare']].sort_values(by = 'Fare', ascending = False).head(10)

                                      Name     Sex   Age      Fare
258                       Ward, Miss. Anna  female  35.0  512.3292
737                 Lesurer, Mr. Gustave J    male  35.0  512.3292
679     Cardeza, Mr. Thomas Drake Martinez    male  36.0  512.3292
88              Fortune, Miss. Mabel Helen  female  23.0  263.0000
27          Fortune, Mr. Charles Alexander    male  19.0  263.0000
341         Fortune, Miss. Alice Elizabeth  female  24.0  263.0000
438                      Fortune, Mr. Mark    male  64.0  263.0000
311             Ryerson, Miss. Emily Borie  female  18.0  262.3750
742  Ryerson, Miss. Susan Parker "Suzette"  female  21.0  262.3750
118               Baxter, Mr. Quigg Edmond    male  24.0  247.5208

2. Ada berapa jenis / unique value dari kolom Pclass? Urutkan dari nilai penjumlahan dari kecil hingga terbesar

In [6]:
titanic['Pclass'].value_counts(ascending = True)

2    184
1    216
3    491
Name: Pclass, dtype: int64

3. Berapa rata-rata Fare male dan female?

In [7]:
titanic[['Sex', 'Fare']].groupby('Sex').mean()

             Fare
Sex
female  44.479818
male    25.523893

4. Berapa banyak passenger male dan female yang survived dan Embarked di 'S'?

In [9]:
MaleSurvived = titanic[(titanic['Sex'] == 'male') & (titanic['Survived'] == 1) & (titanic['Embarked'] =='S')]
FemaleSurvived = titanic[(titanic['Sex'] == 'female') & (titanic['Survived'] == 1) & (titanic['Embarked'] =='S')]
AllSurvived = MaleSurvived + FemaleSurvived
print(f'Jumlah Passenger Male yang Survived dan di Embarked "S" sebanyak = {len(MaleSurvived)}')
print(f'Jumlah Passenger Female yang Survived dan di Embarked "S" sebanyak = {len(FemaleSurvived)}')
print(f'Jumlah Passenger Male dan Female yang Survived dan di Embarked "S" sebanyak = {len(AllSurvived)}')

Jumlah Passenger Male yang Survived dan di Embarked "S" sebanyak = 77
Jumlah Passenger Female yang Survived dan di Embarked "S" sebanyak = 140
Jumlah Passenger Male dan Female yang Survived dan di Embarked "S" sebanyak = 217